InformationRegisters/СтатистикаИспользованияСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаИспользованияСервисов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Частота</Name>
					<Comment>Значение только 1 (еденица)!</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>user_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатистикаИспользованияСервисов/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьСтатистику(СтруктураДанных) Экспорт
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураДанных);
		МенеджерЗаписи.Записать(Ложь);
	Исключение
		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = "Не удалось записать статистику." + Символы.ПС + Ошибка;
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(Текст);
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьСтатистику(ПолучатьПредставленияСсылок) Экспорт
	МассивСтруктурДанных = Новый Массив();
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатистикаИспользованияСервисов.Период,
		|	СтатистикаИспользованияСервисов.УниверсальнаяДата,
		|	СтатистикаИспользованияСервисов.ЧасовойПояс,
		|	СтатистикаИспользованияСервисов.user_id,
		|	ВЫБОР
		|		КОГДА &ПолучатьПредставленияСсылок
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатистикаИспользованияСервисов.ВидСтатистики)
		|		ИНАЧЕ СтатистикаИспользованияСервисов.ВидСтатистики
		|	КОНЕЦ КАК ВидСтатистики,
		|	СтатистикаИспользованияСервисов.Частота
		|ИЗ
		|	РегистрСведений.СтатистикаИспользованияСервисов КАК СтатистикаИспользованияСервисов
		|ГДЕ
		|	НЕ СтатистикаИспользованияСервисов.Отправлено";
	
	Запрос.УстановитьПараметр("ПолучатьПредставленияСсылок", ПолучатьПредставленияСсылок);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДанныхСтатистики = СформироватьСтруктуруСтатистики();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтатистики, ВыборкаДетальныеЗаписи);
		СтруктураДанныхСтатистики.Удалить("Отправлено");
		МассивСтруктурДанных.Добавить(СтруктураДанныхСтатистики);
	КонецЦикла;
	Возврат МассивСтруктурДанных;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СформироватьСтруктуруСтатистики() Экспорт
	УчетнаяЗапись = ОбщиеПроцедурыИФункцииСервер.ПолучитьУчетнуюЗапись();
	СтруктураСтатистики = Новый Структура;
	СтруктураСтатистики.Вставить("ПериодРегистрации", ТекущаяДатаСеанса());
	СтруктураСтатистики.Вставить("УниверсальнаяДата", ТекущаяУниверсальнаяДата());
	СтруктураСтатистики.Вставить("User_id", УчетнаяЗапись.id_user);
	СтруктураСтатистики.Вставить("ЧасовойПояс", ЧасовойПоясСеанса());
	СтруктураСтатистики.Вставить("ВидСтатистики");
	СтруктураСтатистики.Вставить("Частота", 1);
	СтруктураСтатистики.Вставить("Отправлено", Ложь);
	Возврат СтруктураСтатистики;
КонецФункции
#КонецОбласти
